# 2.	Напишите программу, которая определит позицию второго вхождения строки в списке либо сообщит, что её нет.
# 
# *Пример:*
# - список:	["qwe",	"asd",	"zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# - список:	["йцу",	"фыв",	"ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# - список:	["йцу",	"фыв",	"ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# - список:	["123",	"234",	123, "567"], ищем: "123", ответ: -1
# - список: [], ищем: "123", ответ: -1

# lst = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
lst = ["123", "234", 123, "123", "567"]

# Вариант 1: цикл
inString = input("Введите строку поиска: ")
count = 0
index = 0
for l in lst:
    if inString == l:
        count += 1
        if count == 2:
            break
    index += 1

if count == 2:
    print(index)
else:
    print(-1)

# Вариант 1: индекс списка
if lst.count(inString) < 2:
    print(-1)
else:
    lst.remove(inString)
    print(lst.index(inString) + 1)